Revit API Introduction Labs
Lab1_2_CommandArguments Class
 In this lab, we explore the contents and usage of the Execute method's command data input argument and the meaning of the result return code and the message and element set return arguments. The details are discussed in the developer guide, chapter 3.2, External Commands.
 Implement a new external command implementation class named Lab1_2_CommandArguments and its Execute method analogously to the class you implemented in the previous lab.
 The first argument to the Execute method is the command data object which is used to access the application object, from it the current view and document, and from it in turn all or the currently selected elements.
 Let's first report some data about the current application, document and view. Add something like the following to the Execute function body. We make use of the LabUtils InfoMsg method, which is provided in the Revit API Introduction labs source code and provides various wrappers for the Revit task dialogue that we used in Lab 1-1:
CopyC#
//
// access application, document, and current view:
//
UIApplication uiapp = commandData.Application;
Application app = uiapp.Application;
UIDocument uidoc = uiapp.ActiveUIDocument;
Document doc = uidoc.Document;
View view = commandData.View;
LanguageType lt = app.Language;
ProductType pt = app.Product;
string s = "Application = " + app.VersionName
  + "\r\nLanguage = " + lt.ToString()
  + "\r\nProduct = " + pt.ToString()
  + "\r\nVersion = " + app.VersionNumber
  + "\r\nDocument path = " + doc.PathName // empty if not yet saved
  + "\r\nDocument title = " + doc.Title
  + "\r\nView name = " + view.Name;
LabUtils.InfoMsg( s );
CopyVB.NET
'
' access application, document, and current view:
'
Dim uiapp As UIApplication = commandData.Application
Dim app As Application = uiapp.Application
Dim uidoc As UIDocument = uiapp.ActiveUIDocument
Dim doc As Document = uidoc.Document
Dim view As View = commandData.View
Dim lt As LanguageType = app.Language
Dim pt As ProductType = app.Product
Dim s As String = "Application = " + app.VersionName _
    + vbCrLf + "Language = " + lt.ToString() _
    + vbCrLf + "Product = " + pt.ToString() _
    + vbCrLf + "Version = " + app.VersionNumber _
    + vbCrLf + "Document path = " + doc.PathName _
    + vbCrLf + "Document title = " + doc.Title _
    + vbCrLf + "View name = " + view.Name
LabUtils.InfoMsg(s)
 We can use the System.Windows.Forms MessageBox.Show() method to display meassages to users, or the Revit task dialogue like in Lab 1-1. Since it is cumbersome to add an additional argument for the caption each time we call it, we implement some message box helper methods in a separate class LabUtils and call thos instead.
 To list all the currently selected elements, we can use the Selection property on the UIDocument object. This property further exposes an Elements property which returns an element set containing the selected elements. This provided access to the predefined element selection set. We use another LabUtils task dialogue wrapper which populates the main instruction with a message and the contents with a list of strings:
CopyC#
//
// list the current selection set:
//
Selection sel = uidoc.Selection;
List<string> a = new List<string>();
foreach( Element e in sel.Elements )
{
  string name = ( null == e.Category ) ? e.GetType().Name : e.Category.Name;
  a.Add( name + " Id=" + e.Id.IntegerValue.ToString() );
}
LabUtils.InfoMsg( "There are {0} element{1} in the selection set{2}", a );
CopyVB.NET
'
' list the current selection set:
'
Dim sel As Selection = uidoc.Selection
s = "There are " + sel.Elements.Size.ToString() + " elements in the selection:"
For Each elem As Element In sel.Elements
    s += vbCrLf + "  " + elem.Category.Name
    s += " Id=" + elem.Id.IntegerValue.ToString()
Next
LabUtils.InfoMsg(s)
 The last two arguments to the Execute method are return arguments and used only when returning a Cancelled or Failed status to Revit, so that a meaningful message can be displayed in the standard user interface dialogue box and the relevant elements can be highlighted on the graphics screen. To simulate an error condition and display the result of populating these, add the following code:
CopyC#
//
// we pretend that something is wrong with the first
// element in the selection. pass a message back to
// the user and indicate the error result:
//
if( !sel.Elements.IsEmpty )
{
  ElementSetIterator iter = sel.Elements.ForwardIterator();
  iter.MoveNext();
  Element errElem = iter.Current as Element;
  elements.Clear();
  elements.Insert( errElem );
  message = "We pretend something is wrong with this element and pass back this message to user";
  return Result.Failed;
}
else
{
  //
  // we return failed here as well, actually.
  // as long as the message string and element set are empty,
  // it makes no difference to the user.
  // it also aborts the automatic transaction, avoiding marking
  // the database as dirty.
  //
  return Result.Failed;
}
CopyVB.NET
'
' we pretend that something is wrong with the first element in the selection.
' pass a message back to the Revit user and indicate the error result:
'
If Not sel.Elements.IsEmpty Then
    Dim iter As ElementSetIterator = sel.Elements.ForwardIterator
    iter.MoveNext()
    Dim errElem As Element = iter.Current
    elements.Clear()
    elements.Insert(errElem)
    message = "We pretend something is wrong with this" _
        + " element and pass back this message to user"
    Return Result.Failed
Else
    '
    ' we return failed here as well, actually.
    ' as long as the message string and element set are empty,
    ' it makes no difference to the user.
    ' it also aborts the automatic transaction, avoiding marking
    ' the database as dirty.
    '
    Return Result.Failed
End If
 Build the project and adjust the add-in manifest file to include the new command, e.g. by adding the following entries in addition to the existing ones from the Hello World walkthrough:
CopyXML
<AddIn Type="Command">
  <Text>Lab1_2_CommandArguments</Text>
  <Description>Demonstrate contents and usage of the Execute() method's command data input argument and the meaning of the result return code and the message and element set return arguments.</Description>
  <Assembly>C:\a\j\adn\train\revit\2011\src\rac\labs\cs\bin\Debug\labs.dll</Assembly>
  <FullClassName>Labs.Lab1_2_CommandArguments</FullClassName>
  <ClientId>e96140eb-43fe-4e69-9eba-9252ceb55624</ClientId>
</AddIn>
 Now start up Revit, pre-select some elements and run the new Lab 1-2 command. It will display the app, doc and view data, then the currently selected elements, and finally an error reported on the first one of the elements in this set.
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public class Lab1_2_CommandArguments : IExternalCommand
Visual Basic (Declaration)
Public Class Lab1_2_CommandArguments _
	Implements IExternalCommand
Visual C++
public ref class Lab1_2_CommandArguments : IExternalCommand
Inheritance Hierarchy
System.Object
 Labs.Lab1_2_CommandArguments
See Also
Lab1_2_CommandArguments Members
Labs Namespace